perf/end_9090.yaml
config:
  environments:
    node:
      target: 'http://localhost:9090'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 500 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp
      duration: 60
      arrivalRate: 100
      rampTo: 1000
    
scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'