perf/end_ping_proxy.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 500 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: eigth
      duration: 1
      arrivalCount: 25
    - name: pause
      pause: 9
    - name: ninth
      duration: 1
      arrivalCount: 50
    - name: pause
      pause: 9
    - name: tenth
      duration: 1
      arrivalCount: 200
    - name: pause
      pause: 19
    - name: first
      duration: 20
      arrivalCount: 20
    - name: second
      duration: 10
      arrivalRate: 5
    - name: pause
      pause: 10
    - name: third
      duration: 10
      arrivalRate: 25
    - name: pause
      pause: 10
    - name: fourth
      duration: 10
      arrivalRate: 50
    - name: pause
      pause: 10
    - name: fifth
      duration: 10
      arrivalRate: 100
    
scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'